app/controllers/school_classes_controller.rb

def destroy
    SchoolClass.find(params[:id]).destroy
---
DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 1]]
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]