app/controllers/students_controller.rb

  def update
    @student = Student.find_by_id(params[:id])
    @student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Hudgens!"], ["updated_at", "2019-11-09 18:17:40.859412"], ["id", 1]]